[
    {
      "image_path": "./dataset/test/1.jpg",
      "text": "I was a bit sick since yesterday, so I stayed at home to rest in the morning. In the afternoon, I went to participate in the rehearsal of 'Hunger Games Reenacted', which is a drama project for our music class. I wore a face mask since I don't want to transmit the virus to others. The role I played was Effie Trinket, who is fashionable and energetic. In order to stay in character, I wore a yellow floral shirt and white pants. I also brought some flowers as the stage prop for another scene. When I met my classmates at school, I was so excited! Although there were several people absent for the rehearsal, it went on really well. We practiced our walking arrangements and tried hard not to laugh during the act. After rehearsing, we were all really exhausted, so we went out and ate together. We found a Hong Kong restaurant in XinZhongguan Shopping Mall which is near to our school. While enjoying the delicious meal, we talked about our recent experiences, our views on social relationships, and our vision for the future. The chat was really touching. I hope we can be friends forever."
    },
    {
      "image_path": "./dataset/test/2.jpg",
      "text": "Testing, testing — is this thing on? Inspired by Marcy's Journal, I decided to give it a shot. Maybe it can really be useful to my sh*tty oral English. I flipped through some entries I wrote a year ago, and those are actually not bad. At least I can make one of my hobbies, just picking up lines in those Disney cartoons I love and learn a thing or two from them (And Also building connections with characters I love, like Anne — I definitely will imitate her way of journaling in later parts). I’ve never been good at organizing my life (and that's why I have a lot of books with just a few pages used). It's always been my nature to go with the flow and fritter away my time. My thoughts change quickly and that’s another thing bothering me. One minute I'll be full of aspirations, and the next minute I’m immersing myself in Bilibili, I need a redesign! Maybe start by not seeking for so much external attention and just pouring out in my dear Journal! (I'll learn how to illustrate my journal one day!) (My handwriting is not that bad, I reckon, so stop OCD!)\n\nMorning To! Is that weird to call you so? Maybe not, 'cause that's exactly what Marcy called her journal! The closer I’m getting to the exam, the more anxious I become. Only after I poured out to my friend did I realize how unsettled and nervous I've been for the recent few days. I do bear a little grudge against my friend who flaked out on me. However, deep in my heart, it’s my fear of being abandoned and having to fulfill a tough task alone that makes the whole thing so unacceptable. But, you know what? This is the very opportunity to demonstrate that I’m not a timid and dependent person anymore. I’ll calm down, cease to caring about other people's opinions and concentrate on my own schedule. Also, Anne said, “It’s not healthy to fixate on stuff that I have no control over.” Just stay strong!"
    },
    {
        "image_path": "./dataset/test/3.jpg",
        "text": "2022.12.30. Clover.\n\nFreedom.\n\nIt is not only true that most people entirely mis-\nunderstand Freedom, but I sometimes think I have\nnot yet met one person who rightly understands it.\nThe whole Universe is absolute Law. Freedom only\nopens entire activity and license under the Law. To\nthe degraded or undeveloped - and even to too many\nothers - the thought of freedom is a thought of\nescaping from law - which of cause, is impossible.\nMore precious than all wordly riches is Freedom...\nfreedom from the painful constipation and poor\nnarrowness of ecclesiasticism - freedom is manners,\nhabiliments, furniture from the silliness and tyranny\nof local fashions - entire freedom from party rings\nand mere conventions in Politics - and better than all\na general freedom of oneself from the tyrannic\ndomination of vices, habits, appetites, under which\nnearly every man of us often the greatest brawler\nfor freedom, is enslaved. Can we attain such ent-\nranchisement - the true Democracy - and the height\nof it? While we are from birth to death the subjects\nof irrevocible law, enclosing every movement and\nminute, we yet escape, by a paradox, into true free-"
    }, 
    {
        "image_path": "./dataset/test/4.jpg",
        "text": "2022.9.5.\nHappy holiday! Well, I suck at spending holidays, in fact. Just look back on those minor vacations I've taken, few was actually happy or meaningful ones. In weekdays, I have plenty tasks to complete, and with friends by my side, I always know what to do, leaving no room for me to be sentimental. However, during weekends or holidays, I often feel empty and a sense of meaningless. I tried to figure out why... Answers from my inner world suggest that maybe I lack hobbies or the inner world is not rich enough. Ok, in my opinion, this is nonsense. I've got lots of hobbies, watching paints, painting, writing or studying. But, I don't want to do any of these. They have lost their appeal. And I just feel insecure, faint, and have difficulty in breathing. I know it's depression again. Without those bustles to cover them up, my depression, my obsessions, and my anxieties, which have been lurking at every corner of my life, showed up and made me overwhelmed. Well, trust me when I say it's not as tragic as it sounds. (You know, I always depict my life in a kind of dramatic way when in English. Maybe I should try a more natural way next time.) I'm still working on my fit(?) although little progress has been made up to now. Actually I've lost 2 kgs! but it has been offset by a... bwtfet... That's it. Night-Night!"
    }, 
    {
        "image_path": "./dataset/test/5.jpg",
        "text": "Yesterday, I went to a university near our school with my friend. The campus was so beautiful, and I felt so relaxed. I began to wonder about my life when I enter college. It must be a memorable time! However, as we were walking outside, the sky turned grey and dark. So my friends and I found a huge classroom and began to study. Suddenly the rain poured down from the sky and started raining heavily. We were so glad that we got into the classroom on time. Studying on a rainy day is so relaxing and efficient. Then the most interesting part happened. As we were studying, an economics class began. When we realized it, we were already surrounded by almost 150 students. We could do nothing but slip out of the classroom with everyone watching us. It was such an embarrassing and unforgettable experience... As we went outside, the rain stopped. Everything was just right."
    },

    {
        "image_path": "./dataset/test/6.jpg",
        "text": "2022.8.30 Clover\n\n诚恳的分歧往往是进步的好兆头。\n\nFor many of us, a word diary is a practical thing. We use them for work to make a note of appointments or meetings. Scribbling words next to dates to remind us of something we have to do in the future. But journaling is more about feelings. It’s a personal diary, often kept far from prying eyes, sometimes detailing our secrets and desires. But when it comes to feelings, what are the benefits to writing things down? Sometimes it can be difficult to say exactly what we're feeling. Because of anxiety or frustration, it can be tricky to put your problems into words. For some of us, putting pen to paper and jotting down our thoughts is a much easier process than saying them. But it’s not just about the ease of scrawling words. Writing things down can actually help us to formulate ideas, consolidate emotions, and understand our feelings. There's something cathartic about making sense of something that is stressing us, annoying us, or getting us down. Writing a narrative of events or a series of words"
    }, 
    {
        "image_path": "./dataset/test/7.jpg",
        "text": "2022.10.28. Clover.\n\nI asked nothing, only stood at the edge of the wood behind the tree. Languor was still upon the eyes of the dawn, and the dew in the air, the lazy smell of the damp grass hung in the thin mist above the earth. Under the banyan tree you were milking the cow with your hands, tender and fresh as butter and I was standing still. I did not come near you. The sky woke with the sound of the gong at the temple the dust was raised in the road from the hoofs of the driven cattle, with the gurgling pitchers at their hips, women came from the river your bracelets were jingling, and foam brimming over the jar, the morning wore on and I did not come near you. I must go down to the seas again, to the lonely sea and the sky And all I ask is a tall ship and a star to steer her by. And the wheel's kick and the wind's song and the white sail's shaking. And a gray mist on the sea's face, and a gray dawn breaking I must go down to the seas again, for the call of the running tide, Is a wild call and a clear call that may not be denied. And I ask is a windy day with the white clouds flying And the flung"
    },
    {
        "image_path": "./dataset/test/8.jpg",
        "text": "In my dream, I found myself in a sprawling meadow, surrounded by an endless sea of wildflowers. The sun beamed brightly overhead, casting a warm golden glow over the entire landscape. The air is sweet and fragrant, filled with the scent of blooming flowers and fresh grass. I walked through the meadow, feeling carefree and happy, while birds sang melodies from the trees around me."
    },
    {
        "image_path": "./dataset/test/9.jpg",
        "text": "2022.11.15. Clover\n\nCome live with me and be my love, And we will all the pleasures prove, That valleys, groves, hills, and field, Woods, or steepy mountain yields. And we will sit upon the rocks, Seeing the shepherds feed their flocks, By shallow rivers to whose falls, melodious birds sing madrigals. And I will make thee beds of roses, And a thousand fragrant posies, A cap of flowers, and a kirtle embroidered all with leaves of myrtle, A gown made of the finest wool, Which from our pretty lamb we pull, Fair lined slippers from the cold, With coral clasps and amber studs. And if these pleasures may thee move, Come live with me and be my love. The shepherds' swains shall dance and sing For thy delight each May morning. If these delights thy mind may move, Then live with me and be my love. Children have more need of models than of critics. Over every mountain there is a path, although it may not be seen from the valley. Even the wolf has its moments of weakness, in which it sides with the lamb and think I hope it runs away. Until you're ready to look foolish you'll never have the possibility of being great. Let yourself be silently drawn by the stronger pull of what you really love."
    },
    {
        "image_path": "./dataset/test/10.jpg",
        "text": "2024. 4. 24\n\nToday, my illness was recovered, so I went to school as usual. The most exciting thing is about our project of foldable mini lamp for skill class. Our goal is to make a portable lamp that we can put it in our bag during traveling. We put a lot of effort for this project, and we finally finished it today. First, we found a piece of circuit board as the bottom of the lamp. I had tried several tools to cut it into a circle including the saw, brush hook and scissors. It turned out that the big scissor is the most efficient tool for cutting a circuit board. Then, we asked our teacher to find us some LED white lights, wires and resistances. We connected the whole circuit together by paralleling the light bulbs and making them become series with resistances. Next, we welded the circuit by using metal tin. Finally, we positioned the circuit board under the lampshade, which is a foldable transparent water cup. Although there were problems for our lamp, for example, the battery box was exposed outside, the lamp was actually useful and functioned really well, which made me really happy."
    }
]
  